benchmark/results/llama_gpu_on_nautilus_load.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: scenarios/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 16 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 16 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 16/16 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 16 VUs  0m01.0s/1m0s

running (0m02.0s), 16/16 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 16 VUs  0m02.0s/1m0s

running (0m03.0s), 16/16 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 16 VUs  0m03.0s/1m0s

running (0m04.0s), 16/16 VUs, 1 complete and 0 interrupted iterations
default   [   7% ] 16 VUs  0m04.0s/1m0s

running (0m05.0s), 16/16 VUs, 1 complete and 0 interrupted iterations
default   [   8% ] 16 VUs  0m05.0s/1m0s

running (0m06.0s), 16/16 VUs, 1 complete and 0 interrupted iterations
default   [  10% ] 16 VUs  0m06.0s/1m0s

running (0m07.0s), 16/16 VUs, 2 complete and 0 interrupted iterations
default   [  12% ] 16 VUs  0m07.0s/1m0s

running (0m08.0s), 16/16 VUs, 2 complete and 0 interrupted iterations
default   [  13% ] 16 VUs  0m08.0s/1m0s

running (0m09.0s), 16/16 VUs, 3 complete and 0 interrupted iterations
default   [  15% ] 16 VUs  0m09.0s/1m0s

running (0m10.0s), 16/16 VUs, 3 complete and 0 interrupted iterations
default   [  17% ] 16 VUs  0m10.0s/1m0s

running (0m11.0s), 16/16 VUs, 4 complete and 0 interrupted iterations
default   [  18% ] 16 VUs  0m11.0s/1m0s

running (0m12.0s), 16/16 VUs, 4 complete and 0 interrupted iterations
default   [  20% ] 16 VUs  0m12.0s/1m0s

running (0m13.0s), 16/16 VUs, 4 complete and 0 interrupted iterations
default   [  22% ] 16 VUs  0m13.0s/1m0s

running (0m14.0s), 16/16 VUs, 5 complete and 0 interrupted iterations
default   [  23% ] 16 VUs  0m14.0s/1m0s

running (0m15.0s), 16/16 VUs, 5 complete and 0 interrupted iterations
default   [  25% ] 16 VUs  0m15.0s/1m0s

running (0m16.0s), 16/16 VUs, 5 complete and 0 interrupted iterations
default   [  27% ] 16 VUs  0m16.0s/1m0s

running (0m17.0s), 16/16 VUs, 6 complete and 0 interrupted iterations
default   [  28% ] 16 VUs  0m17.0s/1m0s

running (0m18.0s), 16/16 VUs, 6 complete and 0 interrupted iterations
default   [  30% ] 16 VUs  0m18.0s/1m0s

running (0m19.0s), 16/16 VUs, 6 complete and 0 interrupted iterations
default   [  32% ] 16 VUs  0m19.0s/1m0s

running (0m20.0s), 16/16 VUs, 7 complete and 0 interrupted iterations
default   [  33% ] 16 VUs  0m20.0s/1m0s

running (0m21.0s), 16/16 VUs, 7 complete and 0 interrupted iterations
default   [  35% ] 16 VUs  0m21.0s/1m0s

running (0m22.0s), 16/16 VUs, 7 complete and 0 interrupted iterations
default   [  37% ] 16 VUs  0m22.0s/1m0s

running (0m23.0s), 16/16 VUs, 8 complete and 0 interrupted iterations
default   [  38% ] 16 VUs  0m23.0s/1m0s

running (0m24.0s), 16/16 VUs, 8 complete and 0 interrupted iterations
default   [  40% ] 16 VUs  0m24.0s/1m0s

running (0m25.0s), 16/16 VUs, 8 complete and 0 interrupted iterations
default   [  42% ] 16 VUs  0m25.0s/1m0s

running (0m26.0s), 16/16 VUs, 9 complete and 0 interrupted iterations
default   [  43% ] 16 VUs  0m26.0s/1m0s

running (0m27.0s), 16/16 VUs, 9 complete and 0 interrupted iterations
default   [  45% ] 16 VUs  0m27.0s/1m0s

running (0m28.0s), 16/16 VUs, 9 complete and 0 interrupted iterations
default   [  47% ] 16 VUs  0m28.0s/1m0s

running (0m29.0s), 16/16 VUs, 10 complete and 0 interrupted iterations
default   [  48% ] 16 VUs  0m29.0s/1m0s

running (0m30.0s), 16/16 VUs, 10 complete and 0 interrupted iterations
default   [  50% ] 16 VUs  0m30.0s/1m0s

running (0m31.0s), 16/16 VUs, 10 complete and 0 interrupted iterations
default   [  52% ] 16 VUs  0m31.0s/1m0s

running (0m32.0s), 16/16 VUs, 11 complete and 0 interrupted iterations
default   [  53% ] 16 VUs  0m32.0s/1m0s

running (0m33.0s), 16/16 VUs, 11 complete and 0 interrupted iterations
default   [  55% ] 16 VUs  0m33.0s/1m0s

running (0m34.0s), 16/16 VUs, 11 complete and 0 interrupted iterations
default   [  57% ] 16 VUs  0m34.0s/1m0s

running (0m35.0s), 16/16 VUs, 12 complete and 0 interrupted iterations
default   [  58% ] 16 VUs  0m35.0s/1m0s

running (0m36.0s), 16/16 VUs, 12 complete and 0 interrupted iterations
default   [  60% ] 16 VUs  0m36.0s/1m0s

running (0m37.0s), 16/16 VUs, 12 complete and 0 interrupted iterations
default   [  62% ] 16 VUs  0m37.0s/1m0s

running (0m38.0s), 16/16 VUs, 13 complete and 0 interrupted iterations
default   [  63% ] 16 VUs  0m38.0s/1m0s

running (0m39.0s), 16/16 VUs, 13 complete and 0 interrupted iterations
default   [  65% ] 16 VUs  0m39.0s/1m0s

running (0m40.0s), 16/16 VUs, 13 complete and 0 interrupted iterations
default   [  67% ] 16 VUs  0m40.0s/1m0s

running (0m41.0s), 16/16 VUs, 14 complete and 0 interrupted iterations
default   [  68% ] 16 VUs  0m41.0s/1m0s

running (0m42.0s), 16/16 VUs, 14 complete and 0 interrupted iterations
default   [  70% ] 16 VUs  0m42.0s/1m0s

running (0m43.0s), 16/16 VUs, 15 complete and 0 interrupted iterations
default   [  72% ] 16 VUs  0m43.0s/1m0s

running (0m44.0s), 16/16 VUs, 15 complete and 0 interrupted iterations
default   [  73% ] 16 VUs  0m44.0s/1m0s

running (0m45.0s), 16/16 VUs, 15 complete and 0 interrupted iterations
default   [  75% ] 16 VUs  0m45.0s/1m0s

running (0m46.0s), 16/16 VUs, 16 complete and 0 interrupted iterations
default   [  77% ] 16 VUs  0m46.0s/1m0s

running (0m47.0s), 16/16 VUs, 16 complete and 0 interrupted iterations
default   [  78% ] 16 VUs  0m47.0s/1m0s

running (0m48.0s), 16/16 VUs, 16 complete and 0 interrupted iterations
default   [  80% ] 16 VUs  0m48.0s/1m0s

running (0m49.0s), 16/16 VUs, 17 complete and 0 interrupted iterations
default   [  82% ] 16 VUs  0m49.0s/1m0s

running (0m50.0s), 16/16 VUs, 17 complete and 0 interrupted iterations
default   [  83% ] 16 VUs  0m50.0s/1m0s

running (0m51.0s), 16/16 VUs, 17 complete and 0 interrupted iterations
default   [  85% ] 16 VUs  0m51.0s/1m0s

running (0m52.0s), 16/16 VUs, 18 complete and 0 interrupted iterations
default   [  87% ] 16 VUs  0m52.0s/1m0s

running (0m53.0s), 16/16 VUs, 18 complete and 0 interrupted iterations
default   [  88% ] 16 VUs  0m53.0s/1m0s

running (0m54.0s), 16/16 VUs, 18 complete and 0 interrupted iterations
default   [  90% ] 16 VUs  0m54.0s/1m0s

running (0m55.0s), 16/16 VUs, 19 complete and 0 interrupted iterations
default   [  92% ] 16 VUs  0m55.0s/1m0s

running (0m56.0s), 16/16 VUs, 19 complete and 0 interrupted iterations
default   [  93% ] 16 VUs  0m56.0s/1m0s

running (0m57.0s), 16/16 VUs, 19 complete and 0 interrupted iterations
default   [  95% ] 16 VUs  0m57.0s/1m0s

running (0m58.0s), 16/16 VUs, 20 complete and 0 interrupted iterations
default   [  97% ] 16 VUs  0m58.0s/1m0s

running (0m59.0s), 16/16 VUs, 20 complete and 0 interrupted iterations
default   [  98% ] 16 VUs  0m59.0s/1m0s

running (1m00.0s), 16/16 VUs, 20 complete and 0 interrupted iterations
default   [ 100% ] 16 VUs  1m00.0s/1m0s

running (1m01.0s), 15/16 VUs, 21 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m02.0s), 15/16 VUs, 21 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m03.0s), 15/16 VUs, 21 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m04.0s), 14/16 VUs, 22 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m05.0s), 14/16 VUs, 22 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m06.0s), 13/16 VUs, 23 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m07.0s), 13/16 VUs, 23 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m08.0s), 12/16 VUs, 24 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m09.0s), 12/16 VUs, 24 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m10.0s), 11/16 VUs, 25 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m11.0s), 10/16 VUs, 26 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m12.0s), 10/16 VUs, 26 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m13.0s), 10/16 VUs, 26 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m14.0s), 09/16 VUs, 27 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m15.0s), 09/16 VUs, 27 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m16.0s), 08/16 VUs, 28 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m17.0s), 07/16 VUs, 29 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m18.0s), 07/16 VUs, 29 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m19.0s), 07/16 VUs, 29 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m20.0s), 06/16 VUs, 30 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m21.0s), 06/16 VUs, 30 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m22.0s), 05/16 VUs, 31 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m23.0s), 04/16 VUs, 32 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m24.0s), 04/16 VUs, 32 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m25.0s), 04/16 VUs, 32 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m26.0s), 04/16 VUs, 32 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m27.0s), 04/16 VUs, 32 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m28.0s), 03/16 VUs, 33 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m29.0s), 03/16 VUs, 33 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s

running (1m30.0s), 03/16 VUs, 33 complete and 0 interrupted iterations
default ↓ [ 100% ] 16 VUs  1m0s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=33.17s min=3.02s med=36.21s max=50.02s p(90)=49.26s p(95)=50.02s
      { expected_response:true }...: avg=30.85s min=3.02s med=33.58s max=46.21s p(90)=45.94s p(95)=46.21s
    http_req_failed................: 12.12% 4 out of 33
    http_reqs......................: 33     0.366663/s

    EXECUTION
    iteration_duration.............: avg=33.34s min=3.23s med=36.31s max=50.12s p(90)=49.36s p(95)=50.12s
    iterations.....................: 33     0.366663/s
    vus............................: 3      min=3       max=16
    vus_max........................: 16     min=16      max=16

    NETWORK
    data_received..................: 85 kB  939 B/s
    data_sent......................: 38 kB  420 B/s



running (1m30.0s), 00/16 VUs, 33 complete and 3 interrupted iterations
default ✓ [ 100% ] 16 VUs  1m0s